results/r6g-b_write_8.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 8 tps: 1509.10 qps: 9056.93 (r/w/o: 0.00/6038.22/3018.71) lat (ms,95%): 6.43 err/s: 0.10 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1507.85 qps: 9047.23 (r/w/o: 0.00/6031.49/3015.74) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1508.05 qps: 9047.42 (r/w/o: 0.00/6031.31/3016.11) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1504.95 qps: 9030.73 (r/w/o: 0.00/6020.79/3009.94) lat (ms,95%): 6.67 err/s: 0.05 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1497.65 qps: 8986.26 (r/w/o: 0.00/5990.76/2995.50) lat (ms,95%): 6.55 err/s: 0.20 reconn/s: 0.00
[ 120s ] thds: 8 tps: 1503.00 qps: 9018.24 (r/w/o: 0.00/6012.24/3006.00) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 8 tps: 1501.75 qps: 9010.50 (r/w/o: 0.00/6007.00/3003.50) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 8 tps: 1504.20 qps: 9025.35 (r/w/o: 0.00/6016.90/3008.45) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 180s ] thds: 8 tps: 1512.05 qps: 9072.60 (r/w/o: 0.00/6048.40/3024.20) lat (ms,95%): 6.43 err/s: 0.10 reconn/s: 0.00
[ 200s ] thds: 8 tps: 1505.85 qps: 9035.26 (r/w/o: 0.00/6023.50/3011.75) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 220s ] thds: 8 tps: 1497.30 qps: 8983.80 (r/w/o: 0.00/5989.20/2994.60) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 8 tps: 1495.65 qps: 8974.19 (r/w/o: 0.00/5982.79/2991.40) lat (ms,95%): 6.55 err/s: 0.10 reconn/s: 0.00
[ 260s ] thds: 8 tps: 1509.20 qps: 9054.53 (r/w/o: 0.00/6036.02/3018.51) lat (ms,95%): 6.55 err/s: 0.10 reconn/s: 0.00
[ 280s ] thds: 8 tps: 1510.75 qps: 9064.14 (r/w/o: 0.00/6042.54/3021.60) lat (ms,95%): 6.43 err/s: 0.10 reconn/s: 0.00
[ 300s ] thds: 8 tps: 1504.65 qps: 9029.64 (r/w/o: 0.00/6020.29/3009.35) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 320s ] thds: 8 tps: 1514.00 qps: 9082.66 (r/w/o: 0.00/6054.61/3028.05) lat (ms,95%): 6.43 err/s: 0.10 reconn/s: 0.00
[ 340s ] thds: 8 tps: 1507.90 qps: 9049.33 (r/w/o: 0.00/6033.39/3015.94) lat (ms,95%): 6.55 err/s: 0.10 reconn/s: 0.00
[ 360s ] thds: 8 tps: 1495.85 qps: 8975.11 (r/w/o: 0.00/5983.41/2991.70) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 8 tps: 1497.00 qps: 8980.40 (r/w/o: 0.00/5986.40/2994.00) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 8 tps: 1495.60 qps: 8974.82 (r/w/o: 0.00/5983.57/2991.26) lat (ms,95%): 6.67 err/s: 0.05 reconn/s: 0.00
[ 420s ] thds: 8 tps: 1497.15 qps: 8981.93 (r/w/o: 0.00/5987.63/2994.29) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 440s ] thds: 8 tps: 1508.30 qps: 9051.60 (r/w/o: 0.00/6034.90/3016.70) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 460s ] thds: 8 tps: 1509.30 qps: 9055.79 (r/w/o: 0.00/6037.19/3018.60) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 8 tps: 1502.30 qps: 9013.96 (r/w/o: 0.00/6009.31/3004.65) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 500s ] thds: 8 tps: 1511.55 qps: 9069.45 (r/w/o: 0.00/6046.30/3023.15) lat (ms,95%): 6.55 err/s: 0.05 reconn/s: 0.00
[ 520s ] thds: 8 tps: 1512.05 qps: 9072.85 (r/w/o: 0.00/6048.50/3024.35) lat (ms,95%): 6.43 err/s: 0.25 reconn/s: 0.00
[ 540s ] thds: 8 tps: 1509.85 qps: 9059.33 (r/w/o: 0.00/6039.59/3019.74) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 560s ] thds: 8 tps: 1519.85 qps: 9117.31 (r/w/o: 0.00/6077.81/3039.50) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 8 tps: 1509.35 qps: 9058.06 (r/w/o: 0.00/6039.11/3018.95) lat (ms,95%): 6.43 err/s: 0.05 reconn/s: 0.00
[ 600s ] thds: 8 tps: 1504.20 qps: 9025.50 (r/w/o: 0.00/6017.00/3008.50) lat (ms,95%): 6.55 err/s: 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           3613411
        other:                           1806707
        total:                           5420118
    transactions:                        903335 (1505.52 per sec.)
    queries:                             5420118 (9033.33 per sec.)
    ignored errors:                      37     (0.06 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0122s
    total number of events:              903335

Latency (ms):
         min:                                    2.98
         avg:                                    5.31
         max:                                   30.01
         95th percentile:                        6.55
         sum:                              4799054.94

Threads fairness:
    events (avg/stddev):           112916.8750/428.55
    execution time (avg/stddev):   599.8819/0.00