results/r6g-c_read.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 32 tps: 16663.21 qps: 166641.21 (r/w/o: 166641.21/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 17373.53 qps: 173733.92 (r/w/o: 173733.92/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 18013.64 qps: 180135.72 (r/w/o: 180135.72/0.00/0.00) lat (ms,95%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 18319.10 qps: 183192.54 (r/w/o: 183192.54/0.00/0.00) lat (ms,95%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 18915.87 qps: 189158.53 (r/w/o: 189158.53/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 18801.36 qps: 188013.46 (r/w/o: 188013.46/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 18783.13 qps: 187829.17 (r/w/o: 187829.17/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 18783.86 qps: 187839.90 (r/w/o: 187839.90/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 18757.85 qps: 187577.29 (r/w/o: 187577.29/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 18745.62 qps: 187457.17 (r/w/o: 187457.17/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 18809.22 qps: 188092.65 (r/w/o: 188092.65/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 18788.78 qps: 187887.12 (r/w/o: 187887.12/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 18733.95 qps: 187338.97 (r/w/o: 187338.97/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 18797.03 qps: 187972.10 (r/w/o: 187972.10/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 18773.20 qps: 187731.04 (r/w/o: 187731.04/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 18779.68 qps: 187796.63 (r/w/o: 187796.63/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 18783.30 qps: 187832.65 (r/w/o: 187832.65/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 18818.68 qps: 188187.08 (r/w/o: 188187.08/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 18988.08 qps: 189879.25 (r/w/o: 189879.25/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 32 tps: 18935.78 qps: 189359.76 (r/w/o: 189359.76/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 32 tps: 18880.15 qps: 188800.74 (r/w/o: 188800.74/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 32 tps: 18814.64 qps: 188146.96 (r/w/o: 188146.96/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 18829.83 qps: 188297.41 (r/w/o: 188297.41/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 32 tps: 18863.94 qps: 188640.43 (r/w/o: 188640.43/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 32 tps: 19158.74 qps: 191585.22 (r/w/o: 191585.22/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 32 tps: 18857.42 qps: 188575.65 (r/w/o: 188575.65/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 32 tps: 18753.16 qps: 187533.08 (r/w/o: 187533.08/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 32 tps: 18683.48 qps: 186833.09 (r/w/o: 186833.09/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 32 tps: 18733.66 qps: 187336.38 (r/w/o: 187336.38/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 32 tps: 18811.83 qps: 188119.03 (r/w/o: 188119.03/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            111950930
        write:                           0
        other:                           0
        total:                           111950930
    transactions:                        11195093 (18658.12 per sec.)
    queries:                             111950930 (186581.25 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0104s
    total number of events:              11195093

Latency (ms):
         min:                                    0.99
         avg:                                    1.71
         max:                                  245.72
         95th percentile:                        2.18
         sum:                             19182486.73

Threads fairness:
    events (avg/stddev):           349846.6562/37997.74
    execution time (avg/stddev):   599.4527/0.06